{
    "_name_or_path": "checkpoints/eve-7b-prtr0-672-mse", 
    "architectures": ["EVELlamaForCausalLM"], 
    "bos_token_id": 1, 
    "eos_token_id": 2, 
    "hidden_act": "silu", 
    "hidden_size": 4096, 
    "image_aspect_ratio": "square", 
    "image_grid_pinpoints": null, 
    "initializer_range": 0.02, 
    "intermediate_size": 11008, 
    "max_position_embeddings": 4096, 
    "mm_hidden_size": 1024, 
    "mm_projector_lr": null, 
    "mm_projector_type": "mlp2x_gelu", 
    "mm_use_im_patch_token": false, 
    "mm_use_im_start_end": false, 
    "mm_vision_select_feature": "patch", 
    "mm_vision_select_layer": -2, 
    "mm_vision_tower": "videopanda/config/videopanda-vision-LB-patch14-anypixel-448", 
    "mm_vision_tower_teacher": "LanguageBind/LanguageBind_Image", 
    "model_type": "eve", 
    "num_attention_heads": 32, 
    "num_hidden_layers": 32, 
    "num_key_value_heads": 32, 
    "pad_token_id": 0, 
    "pretraining_tp": 1, 
    "requires_image_distill": false, 
    "rms_norm_eps": 1e-05, 
    "rope_scaling": null, 
    "tie_word_embeddings": false, 
    "torch_dtype": "bfloat16", 
    "transformers_version": "4.31.0", 
    "tune_mm_mlp_adapter": false, 
    "use_cache": true, 
    "use_mm_proj": true, 
    "vision_tower_lr": null, 
    "vocab_size": 32000, 
    "mm_video_tower": "videopanda/config/videopanda-video-LB-patch14-anypixel-448", 
    "video_tower_teacher": "LanguageBind/LanguageBind_Video_merge", 
    "requires_video_distill": true, 
    "video_hidden_size": 1024}